Revit 2027 API
TableView.IsValidSectionType Method
 Identifies if the section type is valid for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSectionType(
	SectionType sectionType
)
Public Function IsValidSectionType (
	sectionType As SectionType
) As Boolean
public:
bool IsValidSectionType(
	SectionType sectionType
)
member IsValidSectionType :
        sectionType : SectionType -> bool
Parameters
sectionType SectionType
 The section type.
Return Value
Boolean
 True if the Section Type is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Some TableViews do not contain all of the possible section types. For example, standard schedules have only a Heading and Body.
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace